src/Catalogs/ИС_ЯМ_Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_ЯМ_Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиИзГруппыСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяГруппаСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВЗаказах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСхемуFBO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьОрдерНаОтгрузку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтрокиРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскоеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозчикПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартнаяДоставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОсновнойСкладВЗаказах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДМагазинаОсновногоСкладаГруппы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппыСкладов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДОсновногоСкладаГруппы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппаСкладов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаправленияДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_ЯМ_Склады/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
 
//+ ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980

//+ ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980
&НаКлиенте
Процедура ВыгружатьОстаткиИзГруппыСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураПараметров = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки();
	СтруктураПараметров.ИмяРеквизитаАдресаДоставки 				= "АдресДоставки";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначенияПолей = "АдресДоставкиЗначенияПолей";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначение 		= "АдресДоставкиЗначение";  
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		СтруктураПараметров,
		СтандартнаяОбработка);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей,
		Объект.АдресДоставкиЗначение);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура АвтоматическиСоздаватьОрдерНаОтгрузкуПриИзменении(Элемент)
	УстановитьВидимостьОрдернойСхемы();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672
&НаКлиенте
Процедура СкладскоеПомещениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборПомещение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина); 
	
	ОткрытьФорму("Справочник.СкладскиеПомещения.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеВыбора);
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980
&НаКлиенте
Процедура УстановитьОформление()
		
	Если ЗначениеЗаполнено(Объект.ОбщаяГруппаСкладов) Тогда
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Ложь;
		Элементы.ГруппаСкладов.Видимость = Ложь;
	Иначе
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Объект.ВыгружатьОстаткиИзГруппыСкладов;	
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 30.01.25 УА #88005
	Если Объект.ВыгружатьОстаткиИзГруппыСкладов Тогда
		Элементы.ИспользоватьОсновнойСкладВЗаказах.Видимость = Истина;	
	Иначе
		Элементы.ИспользоватьОсновнойСкладВЗаказах.Видимость = Ложь;
		Объект.ИспользоватьОсновнойСкладВЗаказах 			 = Ложь;
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 30.01.25 УА #88005
	
	УстановитьВидимостьОрдернойСхемы();
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 18.09.2023 УА #61980 

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура УстановитьВидимостьОрдернойСхемы()

	Элементы.СкладскоеПомещение.Видимость 			= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусРасходногоОрдера.Видимость 		= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусСтрокиРасходногоОрдера.Видимость = Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

//+ ИнфоСофт Конышев А.Е. 03.12.24 УА #73126
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СоответствиеПараметровЗаписи = Новый Соответствие;
	СоответствиеПараметровЗаписи.Вставить("ЯндексСтандартнаяДоставка", Объект.СтандартнаяДоставка);
		
	ИС_MP_Сервер.ЗаписатьНастройкиСправочника(Объект.ЛичныйКабинет, СоответствиеПараметровЗаписи);
	
КонецПроцедуры //- ИнфоСофт Конышев А.Е. 03.12.24 УА #73126

//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672
&НаКлиенте
Процедура ОбработатьВыборПомещение(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СкладскоеПомещение =  РезультатЗакрытия;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95672

#КонецОбласти
